aerolinea/app/views/routes/_form.html.erb

    <%= f.label "Aerolinea" %><br>
    <%= f.select :airline_id, Airline.all.collect { |a| [a.name, a.id] } %>
---
SELECT "airlines".* FROM "airlines"

    <%= f.label "Pilotos" %><br>
    <%= f.collection_check_boxes :pilot_ids, Pilot.all, :id, :name %>
---
SELECT "pilots".id FROM "pilots"  WHERE "pilots"."route_id" = ?  [[nil, 1]]