aerolinea/app/views/routes/show.html.erb

  <ul>
    <% @route.pilots.each do |pilot| %>
---
SELECT "pilots".* FROM "pilots" INNER JOIN "pilots_routes" ON "pilots"."id" = "pilots_routes"."pilot_id" WHERE "pilots_routes"."route_id" = ?  [["route_id", 1]]