aerolinea/app/views/trips/_form.html.erb

SELECT "airlines".* FROM "airlines"
---
    <%= f.label "Aerolinea" %><br>
    <%= f.select :airline_id, Airline.all.collect { |a| [a.name, a.id] } %>

SELECT "routes".* FROM "routes"
---
    <%= f.label "Ruta" %><br>
    <%= f.select :route_id, Route.all.collect { |r| [r.origin, r.destination, r.id] } %>