aerolinea/app/views/trips/index.html.erb

SELECT  "routes".* FROM "routes"  WHERE "routes"."id" = ? LIMIT 1  [["id", 1]]
SELECT "pilots".* FROM "pilots" INNER JOIN "pilots_routes" ON "pilots"."id" = "pilots_routes"."pilot_id" WHERE "pilots_routes"."route_id" = ?  [["route_id", 1]]
---
        <ul>
          <% trip.route.pilots.each do |pilot| %>