colegio/app/views/teachers/index.html.erb

SELECT "subjects".* FROM "subjects" INNER JOIN "subjects_teachers" ON "subjects"."id" = "subjects_teachers"."subject_id" WHERE "subjects_teachers"."teacher_id" = ?  [["teacher_id", 1]]
---
        <ul>
          <% teacher.subjects.each do |subject| %>