colegio/app/views/teachers/new.html.erb

SELECT "subjects".* FROM "subjects"
---
  <p>
    <%= f.select :subject_id, Subject.all.collect { |a| [a.name, a.id] } %>