colegio/app/views/teachers/show.html.erb

  <strong>Asignatura: </strong>
  <%= Subject.find(@teacher.subject_id).name %>
---
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 2]]

  <ol>
    <% @teacher.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers"  WHERE "answers"."teacher_id" = ?  [[nil, 1]]