torre_apartamentos/app/controllers/apartments_controller.rb

  def index
    @apartments = Apartment.all
---
SELECT "apartments".* FROM "apartments"

  def edit
    @apartment = Apartment.find(params[:id])
---
SELECT  "apartments".* FROM "apartments"  WHERE "apartments"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @apartment = Apartment.new(apartment_params)
    @apartment.save
---
INSERT INTO "apartments" ("created_at", "floor", "name", "tower_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2016-02-29 20:20:17.766101"], ["floor", 1], ["name", "Apto 001"], ["tower_id", 1], ["updated_at", "2016-02-29 20:20:17.766101"]]

  def show
    @apartment = Apartment.find(params[:id])
    @persons = []
    for person in People.all
---
SELECT  "apartments".* FROM "apartments"  WHERE "apartments"."id" = ? LIMIT 1  [["id", 1]]
SELECT "people".* FROM "people"

  def update
    @apartment = Apartment.find(params[:id])
    @apartment.update(apartment_params)
---
SELECT  "apartments".* FROM "apartments"  WHERE "apartments"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "apartments" SET "name" = ?, "updated_at" = ? WHERE "apartments"."id" = 6  [["name", "Apto 007"], ["updated_at", "2016-03-01 15:48:52.666823"]]