torre_apartamentos/app/controllers/people_controller.rb

SELECT "people".* FROM "people"
---
  def index
    @people = People.all

SELECT  "people".* FROM "people"  WHERE "people"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @people = People.find(params[:id])