torre_apartamentos/app/controllers/towers_controller.rb

  def index
    @towers = Tower.all
---
SELECT "towers".* FROM "towers"

  def edit
    @tower = Tower.find(params[:id])
---
SELECT  "towers".* FROM "towers"  WHERE "towers"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @tower = Tower.new(tower_params)
    @tower.save
---
INSERT INTO "towers" ("created_at", "name", "porter", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-02-29 19:25:25.192994"], ["name", "Torre A"], ["porter", "Cristian"], ["updated_at", "2016-02-29 19:25:25.192994"]]

  def show
    @tower = Tower.find(params[:id])
---
SELECT  "towers".* FROM "towers"  WHERE "towers"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @tower = Tower.find(params[:id])
---
SELECT  "towers".* FROM "towers"  WHERE "towers"."id" = ? LIMIT 1  [["id", 1]]