colegio/app/controllers/answers_controller.rb

  def create
    @answer = Answer.new(answer_params)
    @answer.subject = @answer.homework.subject
    @answer.subject_id = @answer.homework.subject.id
    @answer.save
---
INSERT INTO "answers" ("created_at", "homework_id", "message", "student_id", "subject_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2016-03-02 22:56:00.038077"], ["homework_id", 7], ["message", "ei bi ci do"], ["student_id", 3], ["subject_id", 1], ["updated_at", "2016-03-02 22:56:00.038077"]]