colegio/app/controllers/homeworks_controller.rb

  def index
    @homeworks = Homework.all
---
SELECT "homeworks".* FROM "homeworks"

  def create
    @homework = Homework.new(homework_params)
    @homework.teacher = @homework.subject.teacher
    @homework.save
---
INSERT INTO "homeworks" ("created_at", "final_date", "statement", "subject_id", "teacher_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2016-03-02 21:28:55.050767"], ["final_date", "12"], ["statement", "sdfdsfsfsffs"], ["subject_id", 2], ["teacher_id", 1], ["updated_at", "2016-03-02 21:28:55.050767"]]

  def edit
    @homework = Homework.find(params[:id])
---
SELECT  "homeworks".* FROM "homeworks"  WHERE "homeworks"."id" = ? LIMIT 1  [["id", 3]]

  def show
    @homework = Homework.find(params[:id])
---
SELECT  "homeworks".* FROM "homeworks"  WHERE "homeworks"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @homework = Homework.find(params[:id])
    @homework.update(homework_params)
---
SELECT  "homeworks".* FROM "homeworks"  WHERE "homeworks"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "homeworks" SET "final_date" = ?, "statement" = ?, "updated_at" = ? WHERE "homeworks"."id" = 3  [["final_date", "22/03/16"], ["statement", "Resolver las ecuaciones"], ["updated_at", "2016-03-02 21:51:25.474242"]]