colegio/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    @student.save
---
INSERT INTO "students" ("created_at", "email", "identification", "last_name", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students"  WHERE "students"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "students" SET "identification" = ?, "updated_at" = ? WHERE "students"."id" = 3  [["identification", "9652112448"], ["updated_at", "2016-03-02 22:17:15.460357"]]