colegio/app/controllers/subjects_controller.rb

SELECT  "students".* FROM "students"  WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def by_student
    @student = Student.find(params[:student_id])

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 5]]
---
  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy

INSERT INTO "subjects" ("code", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["code", 109], ["created_at", "2016-03-02 19:27:45.364770"], ["name", "Psicologia"], ["updated_at", "2016-03-02 19:27:45.364770"]]
---
  def create
    @subject = Subject.new(subject_params)
    @subject.save

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @subject = Subject.find(params[:id])

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "subjects" SET "teacher_id" = ?, "updated_at" = ? WHERE "subjects"."id" = 1  [["teacher_id", 2], ["updated_at", "2016-03-02 19:50:40.283808"]]
---
  def update
    @subject = Subject.find(params[:id])
    @subject.update(subject_params)