colegio/app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("created_at", "email", "identification", "last_name", "name", "subject_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @teacher = Teacher.new(teacher_params)
    @teacher.save

SELECT  "teachers".* FROM "teachers"  WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @teacher = Teacher.find(params[:id])

SELECT  "teachers".* FROM "teachers"  WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @teacher = Teacher.find(params[:id])

SELECT  "teachers".* FROM "teachers"  WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "teachers" SET "subject_id" = ?, "updated_at" = ? WHERE "teachers"."id" = 3  [["subject_id", 4], ["updated_at", "2016-03-02 20:06:32.891664"]]
---
  def update
    @teacher = Teacher.find(params[:id])
    @teacher.update(teacher_params)