colegio/app/views/answers/new.html.erb

SELECT "students".* FROM "students"
---
      <%= f.label "Estudiante" %><br>
      <%= f.select :student_id, Student.all.collect { |s| [s.name, s.last_name, s.id] } %>

SELECT "homeworks".* FROM "homeworks"
---
      <%= f.label "Tarea" %><br>
      <%= f.select :homework_id, Homework.all.collect { |s| [s.statement, s.id] } %>