ejercicio_facturas/app/views/facturas/_form.html.erb

    <strong><%= f.label "Productos" %></strong><br>
    <%= f.collection_check_boxes :producto_ids, Producto.all, :id, :nombre %>
---
SELECT "productos".* FROM "productos"