aerolinea/app/views/airlines/_form.html.erb

    <%= f.label "Rutas" %><br>
    <%= f.collection_check_boxes :route_ids, Route.all, :id, :origin %>
---
SELECT "routes".id FROM "routes"  WHERE "routes"."airline_id" = ?  [["airline_id", 1]]