aerolinea/app/views/airlines/show.html.erb

    <ol>
      <% @airline.routes.each do |route| %>
---
SELECT "routes".* FROM "routes"  WHERE "routes"."airline_id" = ?  [["airline_id", 1]]