aerolinea/app/views/pilots/_form.html.erb

SELECT "airplanes".* FROM "airplanes"
---
    <%= f.label "Avion" %><br>
    <%= f.select :airplane_id, Airplane.all.collect { |a| [a.name, a.id] } %>