aerolinea/app/views/airplanes/_form.html.erb

    <%= f.label "Piloto" %>
    <%= f.select :pilot_id, Pilot.all.collect { |p| [p.name, p.id] } %>
---
SELECT "pilots".* FROM "pilots"