ejercicio_facturas/app/controllers/facturas_controller.rb

  def index
    @facturas = Factura.all
---
SELECT "facturas".* FROM "facturas"