ejercicio_facturas/app/controllers/productos_controller.rb

SELECT "productos".* FROM "productos"
---
  def index
    @productos = Producto.all

INSERT INTO "productos" ("created_at", "nombre", "precio", "referencia", "tipo", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2016-03-04 22:06:30.740319"], ["nombre", "Cepillo de dientes"], ["precio", 2500.0], ["referencia", 5], ["tipo", "Aseo personal"], ["updated_at", "2016-03-04 22:06:30.740319"]]
---
  def create
    @producto = Producto.new(producto_params)

    respond_to do |format|
      if @producto.save

UPDATE "productos" SET "nombre" = ?, "precio" = ?, "referencia" = ?, "tipo" = ?, "updated_at" = ? WHERE "productos"."id" = 1  [["nombre", "escoba"], ["precio", 3800.0], ["referencia", 10], ["tipo", "aseo"], ["updated_at", "2016-03-04 22:29:33.987548"]]
---
  def update
    respond_to do |format|
      if @producto.update(producto_params)

SELECT  "productos".* FROM "productos"  WHERE "productos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_producto
      @producto = Producto.find(params[:id])