torre_apartamentos/app/views/apartments/edit.html.erb

SELECT "towers".* FROM "towers"
---
  <p>
    <%= f.select :tower_id, Tower.all.collect { |t| [t.name, t.id] } %>