torre_apartamentos/app/views/apartments/index.html.erb

SELECT  "towers".* FROM "towers"  WHERE "towers"."id" = ? LIMIT 1  [["id", 1]]
---
    <li>
      <%= "#{apartment.name} | #{Tower.find(apartment.tower_id).name} | Piso: #{apartment.floor}" %> |