torre_apartamentos/app/views/apartments/new.html.erb

  <p>
    <%= f.select :tower_id, Tower.all.collect { |t| [t.name, t.id] } %>
---
SELECT "towers".* FROM "towers"