torre_apartamentos/app/views/apartments/show.html.erb

SELECT  "towers".* FROM "towers"  WHERE "towers"."id" = ? LIMIT 1  [["id", 1]]
---
  Torre:
  <%= Tower.find(@apartment.tower_id).name %>

SELECT  "apartments".* FROM "apartments"  WHERE "apartments"."id" = ? LIMIT 1  [["id", 1]]
---
  <% Person.all.each do |person| %>
    <% if Apartment.find(person.apartment_id) == @apartment %>