colegio/app/views/students/edit.html.erb

SELECT "subjects".* FROM "subjects"
---
    <%= f.label "Asignaturas" %><br>
    <%= f.collection_check_boxes :subject_ids, Subject.all, :id, :name %>