colegio/app/views/students/new.html.erb

SELECT "subjects".* FROM "subjects"
---
      <%= f.label "Asignaturas" %>
      <%= f.collection_check_boxes :subject_ids, Subject.all.collect, :id, :name %>