colegio/app/views/students/show.html.erb

SELECT "subjects".* FROM "subjects" INNER JOIN "students_subjects" ON "subjects"."id" = "students_subjects"."subject_id" WHERE "students_subjects"."student_id" = ?  [["student_id", 1]]
---
      <ul>
        <% @student.subjects.each do |subject| %>