torre_apartamentos/app/views/people/edit.html.erb

SELECT "apartments".* FROM "apartments"
---
  <p>
    <%= f.select :apartment_id, Apartment.all.collect { |t| [t.name, t.id] } %>