torre_apartamentos/app/views/people/index.html.erb

SELECT  "apartments".* FROM "apartments"  WHERE "apartments"."id" = ? LIMIT 1  [["id", 12]]
SELECT  "towers".* FROM "towers"  WHERE "towers"."id" = ? LIMIT 1  [["id", 2]]
---
      <%= "#{person.name} | #{person.identification} | " %>
      <%= "#{Apartment.find(person.apartment_id).name} | \
      	Piso: #{Apartment.find(person.apartment_id).floor} | \
      	#{Tower.find(Apartment.find(person.apartment_id).tower_id).name}" %> |