torre_apartamentos/app/views/people/show.html.erb

  Apartamento:
  <%= Apartment.find(@person.apartment_id).name %>
---
SELECT  "apartments".* FROM "apartments"  WHERE "apartments"."id" = ? LIMIT 1  [["id", 10]]

  )
  (
  <%= Tower.find(Apartment.find(@person.apartment_id).tower_id).name %>
  )
---
SELECT  "towers".* FROM "towers"  WHERE "towers"."id" = ? LIMIT 1  [["id", 2]]