colegio/app/views/homeworks/edit.html.erb

SELECT "subjects".* FROM "subjects"
---
    <div>
      <%= f.select :subject_id, Subject.all.collect { |t| [t.name, t.id] } %>