colegio/app/views/homeworks/new.html.erb

  <p>
    <%= f.select :subject_id, Subject.all.collect { |t| [t.name, t.id] } %>
---
SELECT "subjects".* FROM "subjects"