colegio/app/views/subjects/edit.html.erb

    <%= f.label "Profesor" %>
    <%= f.select :teacher_id, Teacher.all.collect { |t| [t.name, t.id] } %>
---
SELECT "teachers".* FROM "teachers"