colegio/app/views/subjects/new.html.erb

SELECT "teachers".* FROM "teachers"
---
    <%= f.label "Profesores" %>
    <%= f.collection_check_boxes :teacher_ids, Teacher.all.collect { |t| [t.name, t.last_name, t.id] } %>