colegio/app/views/subjects/show.html.erb

SELECT "teachers".* FROM "teachers" INNER JOIN "subjects_teachers" ON "teachers"."id" = "subjects_teachers"."teacher_id" WHERE "subjects_teachers"."subject_id" = ?  [["subject_id", 1]]
---
      <ul>
        <% @subject.teachers.each do |teacher| %>

SELECT "homeworks".* FROM "homeworks"  WHERE "homeworks"."subject_id" = ?  [["subject_id", 1]]
---
      <ul>
        <% @subject.homeworks.each do |homework| %>