aerolinea/app/controllers/airlines_controller.rb

  def index
    @airlines = Airline.all
---
SELECT "airlines".* FROM "airlines"

  def create
    @airline = Airline.new(airline_params)

    respond_to do |format|
      if @airline.save
---
INSERT INTO "airlines" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2016-03-07 21:42:25.846122"], ["name", "World Cuisser"], ["updated_at", "2016-03-07 21:42:25.846122"]]

  def update
    respond_to do |format|
      if @airline.update(airline_params)
---
UPDATE "airlines" SET "name" = ?, "updated_at" = ? WHERE "airlines"."id" = 1  [["name", "American Flight"], ["updated_at", "2016-03-08 19:32:02.420710"]]

    def set_airline
      @airline = Airline.find(params[:id])
---
SELECT  "airlines".* FROM "airlines"  WHERE "airlines"."id" = ? LIMIT 1  [["id", 1]]