aerolinea/app/controllers/airplanes_controller.rb

SELECT  "airplanes".* FROM "airplanes"  WHERE "airplanes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @airplane = Airplane.find(params[:id])

INSERT INTO "airplanes" ("created_at", "name", "pilot_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-03-07 21:16:27.323536"], ["name", "Boing 767"], ["pilot_id", 1], ["updated_at", "2016-03-07 21:16:27.323536"]]
---
  def create
    @airplane = Airplane.new(airplane_params)

    respond_to do |format|
      if @airplane.save

UPDATE "airplanes" SET "name" = ?, "updated_at" = ? WHERE "airplanes"."id" = 1  [["name", "Avion 1"], ["updated_at", "2016-03-08 18:58:41.164763"]]
---
  def update
    respond_to do |format|
      if @airplane.update(airplane_params)

SELECT  "airplanes".* FROM "airplanes"  WHERE "airplanes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_airplane
      @airplane = Airplane.find(params[:id])