aerolinea/app/controllers/pilots_controller.rb

SELECT "pilots".* FROM "pilots"
---
  def index
    @pilots = Pilot.all

INSERT INTO "pilots" ("airplane_id", "created_at", "identification", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["airplane_id", 3], ["created_at", "2016-03-08 18:56:14.065666"], ["identification", "4565257"], ["name", "Poll"], ["updated_at", "2016-03-08 18:56:14.065666"]]
---
  def create
    @pilot = Pilot.new(pilot_params)

    respond_to do |format|
      if @pilot.save

UPDATE "pilots" SET "identification" = ?, "updated_at" = ? WHERE "pilots"."id" = 3  [["identification", "4565722"], ["updated_at", "2016-03-07 20:14:03.896903"]]
---
  def update
    respond_to do |format|
      if @pilot.update(pilot_params)

DELETE FROM "pilots" WHERE "pilots"."id" = ?  [["id", 8]]
---
  def destroy
    @pilot.destroy

SELECT  "pilots".* FROM "pilots"  WHERE "pilots"."id" = ? LIMIT 1  [["id", 8]]
---
    def set_pilot
      @pilot = Pilot.find(params[:id])