aerolinea/app/controllers/routes_controller.rb

INSERT INTO "routes" ("created_at", "destination", "origin", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-03-07 21:22:51.158477"], ["destination", "New York"], ["origin", "Bogota"], ["updated_at", "2016-03-07 21:22:51.158477"]]
---
  def create
    @route = Route.new(route_params)

    respond_to do |format|
      if @route.save

SELECT  "routes".* FROM "routes"  WHERE "routes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_route
      @route = Route.find(params[:id])