aerolinea/app/controllers/trips_controller.rb

INSERT INTO "trips" ("arrival_time", "created_at", "depart_time", "route_id", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @trip = Trip.new(trip_params)
    @trip.save

SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @trip = Trip.find(params[:id])

SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "trips" SET "airline_id" = ?, "updated_at" = ? WHERE "trips"."id" = 1  [["airline_id", 1], ["updated_at", "2016-03-08 18:45:49.917111"]]
---
  def update
    @trip = Trip.find(params[:id])
    @trip.update(trip_params)