login/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Devise"], ["message", "Que vuelta!!"], ["created_at", "2016-03-16 19:03:42.555037"], ["updated_at", "2016-03-16 19:03:42.555037"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "message" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["message", "Ya lo llevo"], ["updated_at", "2016-03-18 20:50:14.628031"], ["id", 4]]
---
  def update
    @post = Post.find(params[:id])
    @post.user_id = current_user.id
    @post.update(post_params)